In [4]:
import pandas as pd
from sqlalchemy import create_engine
import sqlite3
from sqlalchemy.types import Numeric, Integer, String


DB = {'servername': 'XPS15\\SQLEXPRESS', 'database': 'gecombineerde_database2'}

#SQLAlchemy engine voor SQL Server
engine_str = (
    f"mssql+pyodbc://{DB['servername']}/{DB['database']}?"
    "trusted_connection=yes&driver=ODBC+Driver+17+for+SQL+Server"
)

engine = create_engine(engine_str)

1e csv bestand inventory_levels_train

In [5]:
# CSV-bestand inlezen
inventory_dataframe= pd.read_csv("inventory_levels_train.csv")
inventory_dataframe

,Unnamed: 0,INVENTORY_YEAR,INVENTORY_MONTH,PRODUCT_NUMBER,INVENTORY_COUNT
0,0,2023,4,48,1932
1,1,2023,4,49,1400
2,2,2023,4,50,21705
3,3,2023,4,51,9710
4,4,2023,4,52,5616
...,...,...,...,...,...
3538,3790,2023,4,43,6147
3539,3791,2023,4,44,5822
3540,3792,2023,4,45,1676
3541,3793,2023,4,46,1802
3542,3794,2023,4,47,5605

In [10]:
# Verwijder de ongewenste kolom als die bestaat
inventory_dataframe = inventory_dataframe.drop(columns=["Unnamed: 0"], errors="ignore")
#inventory_dataframe
# Schrijf de DataFrame weg naar de database.
# if_exists='replace' zorgt ervoor dat als de tabel al bestaat, deze eerst wordt verwijderd en opnieuw aangemaakt.
inventory_dataframe.to_sql('inventory', engine, if_exists='replace', index=False)

print("Data succesvol ingevoegd!")

Data succesvol ingevoegd!

2e csv_bestand product_forecast_train

In [11]:
# 2e CSV-bestand inlezen
product_forcast_dataframe= pd.read_csv("product_forecast_train.csv")
product_forcast_dataframe

      PRODUCT_NUMBER  YEAR  MONTH  EXPECTED_VOLUME
0                 45  2023     12               90
1                 46  2023     12               84
2                 47  2023     12              468
3                 48  2023     12               91
4                 49  2023     12               35
...              ...   ...    ...              ...
3524              37  2022      1               60
3525              38  2022      1               51
3526              39  2022      1              235
3527              40  2022      1              568
3528              41  2022      1               84

[3529 rows x 4 columns]

In [12]:
# Schrijf de DataFrame weg naar SQL Server.
# if_exists='replace' zorgt ervoor dat de tabel wordt aangemaakt of vervangen indien deze al bestaat.
product_forcast_dataframe.to_sql('product_forecast', engine, if_exists='replace', index=False)

print("Data succesvol ingevoegd!")

Data succesvol ingevoegd!